Repository: CyberGrandChallenge/linux-source-3.13.2-cgc
Catalog: debian/po/*.po
Languages: fr

source: You are installing a kernel with an initrd image
fr: Installation d'un noyau avec une image disque de démarrage (« initrd »)

source: You are attempting to install an initrd kernel image (version =V) on a machine currently running kernel version ${hostversion}.
fr: Installation d'une image disque de démarrage (« initrd ») du noyau (version =V) sur une machine qui utilise un noyau version ${hostversion}.

source: I have been unable to find a suitable tool for generating initrd images (I looked at the list "${ramdisk}") This will break the installation, unless such tools are also being installed right now in the same run. (This means, one from the following list ${initrddep})
fr: Impossible de trouver (dans ${ramdisk}) les outils nécessaires pour créer une image disque de démarrage (« initrd »). L'installation va être interrompue, sauf s'il est prévu d'installer maintenant de tels outils (parmis ${initrddep}).

source: Do you want to abort now?
fr: Voulez-vous abandonner maintenant ?

source: You are attempting to install an initrd kernel image (version =V) This will not work unless you have configured your boot loader to use initrd. (An initrd image is a kernel image that expects to use an INITial Ram Disk to mount a minimal root file system into RAM and use that for booting).
fr: L'installation d'une image disque de démarrage (« initrd ») pour le noyau (version =V) ne fonctionnera que si vous avez configuré le programme de démarrage (« boot loader ») pour qu'il utilise une telle image. Une image disque de démarrage (initrd = INITial Ram Disk), est une image du noyau qui monte un disque virtuel dans la mémoire vive avec un système de fichiers racine minimal qui permet de démarrer la machine.

source: I repeat, You need to configure your boot loader -- please read your bootloader documentation for details on how to add initrd images.
fr: Il est indispensable de configurer le programme de démarrage. Veuillez consulter sa documentation pour connaître la manière d'y ajouter des images « initrd ».

source: If you have already done so, and you wish to get rid of this message, please put "do_initrd = Yes" in /etc/kernel-img.conf. Note that this is optional, but if you do not, you will continue to see this message whenever you install a kernel image using initrd.
fr: Si vous l'avez déjà fait, et que vous ne voulez plus que ce message s'affiche, ajoutez « do_initrd = Yes » dans /etc/kernel-img.conf. Cela est facultatif, mais permettra d'éviter l'affichage de ce message à chaque installation d'une image de noyau utilisant une image disque de démarrage.

source: As a reminder, in order to configure LILO, you need to add an 'initrd=/initrd.img' to the image=/vmlinuz stanza of your /etc/lilo.conf
fr: Pour configurer LILO, vous devez ajouter « initrd=/initrd.img » à la section image=/vmlinuz du fichier /etc/lilo.conf

source: As a reminder, in order to configure ELILO, you need to add an 'initrd=/initrd.img' to the image=/vmlinuz stanza of your /etc/elilo.conf
fr: Pour configurer ELILO, vous devez ajouter « initrd=/initrd.img » à la section image=/vmlinuz du fichier /etc/elilo.conf

source: Lilo has a ramdisk line, which should be commented or removed
fr: Commentez ou supprimez la ligne ramdisk présente dans /etc/lilo.conf

source: I have found a line ${LINE} in /etc/lilo.conf that should be removed or commented out, since you are using initrd/initramfs.
fr: Supprimez ou commentez la ligne ${LINE} présente dans /etc/lilo.conf afin d'utiliser initrd/initramfs.

source: Aborting install since loading an initrd kernel image
fr: Abandon de l'installation : une image disque de démarrage du noyau est en cours de chargement.

source: You are attempting to install an initrd kernel image (version =V) This will not work unless you have configured your boot loader to use initrd. (An initrd image is a kernel image that expects to use an INITial Ram Disk to mount a minimal root file system into RAM and use that for booting). Unfortunately, since this Question pertaining to this was not shown, and the default action is to abort the install. =ST-image-=V aborted.
fr: L'installation d'une image disque de démarrage (« initrd ») pour le noyau (version =V) ne fonctionnera que si vous avez configuré le programme de démarrage (« boot loader ») pour qu'il utilise une telle image. Une image disque de démarrage (initrd = INITial Ram Disk), est une image du noyau qui monte un disque virtuel dans la mémoire vive avec un système de fichiers racine minimal qui permet de démarrer la machine. La question correspondante a été omise, et l'action par défaut est alors d'abandonner l'installation. Abandon de =ST-image-=V.

source: Failed to move modules out of the way, aborting
fr: Impossible de déplacer les modules, abandon

source: You are attempting to install a kernel image (version =V) However, the directory ${modules_base}/=V/kernel still exists.
fr: Vous installez une image du noyau (version =V). Cependant, le répertoire ${modules_base}/=V/kernel existe déjà.

source: As you have instructed, an attempt was made to move the directory out of the way. Unfortunately, There was a problem moving ${modules_base}/=V to ${modules_base}/${dest}.
fr: La tentative pour déplacer le répertoire ${modules_base}/=V vers ${modules_base}/${dest} a échoué.

source: I suggest you move $modules_base/$version out of the way manually, and then try re-installing this image.
fr: Vous devriez déplacer $modules_base/$version vous-même, puis essayer de réinstaller cette image.

source: I am aborting.
fr: Abandon.

source: Stop install since the kernel-image is already installed?
fr: L'image du noyau est déjà installée, faut-il arrêter l'installation ?

source: You are attempting to install a kernel image (version =V) However, the directory ${modules_base}/=V/kernel still exists. If this directory belongs to a previous ${package} package, and if you have deselected some modules, or installed standalone modules packages, this could be bad.
fr: Vous installez une image du noyau (version =V). Toutefois, le répertoire ${modules_base}/=V/kernel existe déjà. Cela pourrait poser un problème s'il appartient à un ancien paquet ${package} et si vous avez désélectionné certains modules, ou si vous avez installé des paquets de modules isolés.

source: If ${modules_base}/=V/kernel belongs to a old install of ${package}, then this is your last chance to abort the installation of this kernel image (nothing has been changed yet).
fr: Si ${modules_base}/=V/kernel provient d'une installation précédente de ${package}, vous pouvez encore interrompre l'installation de cette image du noyau. Aucune modification n'a encore eu lieu.

source: If you know what you are doing, and if you feel that this image should be installed despite this anomaly, Please answer n to the question.
fr: Ne choisissez de continuer que si vous avez la certitude que l'image doit être installée malgré cette anomalie.

source: Otherwise, I suggest you move ${modules_base}/=V/kernel out of the way, perhaps to ${modules_base}/=V.kernel.old or something, and then try re-installing this image.
fr: Vous pouvez aussi renommer ${modules_base}/=V/kernel (en ${modules_base}/=V.kernel.old par exemple) puis essayer de réinstaller cette image.

source: Aborting install since modules exist
fr: Les modules existent, interruption de l'installation.

source: You are attempting to install an initrd kernel image (version =V). However, the corresponding kernel modules directory exists, and there was no permission given to silently delete the modules directory. Unfortunately, since this Question pertaining to this was not shown, and the default action is to abort the install. =ST-image-=V aborted.
fr: Vous installez une image disque de démarrage (« initrd ») du noyau (version =V). Toutefois, le répertoire du module du noyau existe, et vous n'avez pas les permissions nécessaires pour le supprimer. La question correspondante a été omise, et l'action par défaut est alors d'abandonner l'installation. Interruption de =ST-image-=V.

source: The kernel version running is the same as the one being installed
fr: Nouveau noyau de même version

source: You are attempting to install a kernel version that is the same as the version you are currently running (version ${running}). The modules list is quite likely to have been changed, and the modules dependency file ${modules_base}/=V/modules.dep needs to be re-built. It can not be built correctly right now, since the module list for the running kernel are likely to be different from the kernel installed. I am creating a new modules.dep file, but that may not be correct. It shall be regenerated correctly at next reboot.
fr: Le noyau installé est de même version que l'actuel (version ${running}). La liste des modules a très certainement changé, et le fichier des dépendances des modules ${modules_base}/=V/modules.dep doit être recompilé. Il ne pourra pas être compilé correctement maintenant, la liste des modules pour le noyau actuel étant sûrement différente de celle du noyau installé. Un nouveau fichier modules.dep sera créé, mais il sera probablement incorrect. Il sera recréé correctement au prochain redémarrage.

source: I repeat: you have to reboot in order for the modules file to be created correctly. Until you reboot, it may be impossible to load some modules. Reboot as soon as this install is finished (Do not reboot right now, since you may not be able to boot back up until installation is over, but boot immediately after). I can not stress that too much. You need to reboot soon.
fr: Vous devrez absolument redémarrer aussitôt l'installation terminée pour que les fichiers des modules soient correctement créés. Jusque là, certains modules peuvent être impossible à charger. Veillez à bien attendre la fin de l'installation, sinon vous risqueriez de ne pas pouvoir redémarrer. Vous devrez ensuite redémarrer dès que possible.

source: Create a symbolic link to the current kernel image?
fr: Faut-il créer un lien symbolique vers l'image actuelle du noyau ?

source: I notice that you do not have ${kimage} symbolic link. I can create one for you, and it shall be updated by newer kernel image packages. This is useful if you use a boot loader like lilo.
fr: Le lien symbolique ${kimage} ne semble pas exister mais peut être créé. Il sera mis à jour par de nouveaux paquets d'images du noyau, ce qui peut être utile si vous utilisez un programme de démarrage tel que LILO.

source: Image symbolic link destination is a directory, aborting
fr: Le lien symbolique de l'image pointe vers un répertoire, abandon.

source: ${kimage} is a directory, which I did not expect. I am trying to create a symbolic link with that name linked to ${image_dest}. Since a directory exists here, my assumptions are way off, and I am aborting.
fr: ${kimage} ne devrait pas être un répertoire. Il est impossible de créer un lien avec ce nom vers ${image_dest}, où se trouve un répertoire, interruption.

source: This may be benign, (You may have versioned symbol names, for instance). Or this could be an error. depmod exited with return value ${exit_value} ${SIGNAL}${CORE}. I am deleting the file ${modules_base}/=V/modules.dep. However, since depmod is run at install time, we could just defer running depmod.
fr: Cela n'est peut-être pas une erreur (vous avez peut-être modifié la version de certains noms de symboles, par exemple) : depmod s'est arrêté en retournant la valeur ${exit_value} ${SIGNAL}${CORE}. Le fichier ${modules_base}/=V/modules.dep sera supprimé. Toutefois, il est possible de différer l'exécution de depmod, celui-ci étant exécuté au moment de l'installation.

source: This may be benign, (You may have versioned symbol names, for instance). Or this could be an error. depmod exited with return value ${exit_value} . ${SIGNAL} ${CORE} Since this image uses initrd, I am not deleting the file ${modules_base}/=V/modules.dep. However, there is no guarantee that the file is valid. I would strongly advice you to either abort and fix the errors in depmod, or regenerate the initrd image with a known good modules.dep file. I repeat, an initrd kernel image with a bad modules.dep shall fail to boot.
fr: Cela n'est peut-être pas une erreur (vous avez peut-être modifié la version de certains noms de symboles, par exemple) : depmod s'est arrêté en retournant la valeur ${exit_value} ${SIGNAL} ${CORE}. Comme l'image utilise une image disque de démarrage (« initrd »), le fichier ${modules_base}/=V/modules.dep ne sera pas supprimé. Il n'y a toutefois aucune garantie que ce fichier soit valable. Il vous est fortement recommandé d'annuler, et de réparer les erreurs dans depmod, ou de recréer l'image disque de démarrage avec un fichier modules.dep correct. Une image disque de démarrage du noyau avec un fichier modules.dep incorrect risque de ne pas pouvoir démarrer.

source: Should the old initrd link be deleted now?
fr: Faut-il supprimer l'ancien lien « initrd » maintenant ?

source: I note that you have an old initrd symbolic link in place. The name of the symbolic link is being changed to initrd.img. If the old link is deleted, you may have to update the boot loader. If the link is left in place, it will point to the wrong image.
fr: Un ancien lien symbolique « initrd » est présent, et sera renommé initrd.img. Si cet ancien lien est supprimé, vous devrez mettre à jour le programme de démarrage (« boot loader »). S'il est conservé, il pointera vers la mauvaise image.

source: I note that you have an old ${image_dir}/initrd symbolic link in place. The location of the symbolic link is now the same location as the kernel image symbolic links, namely, in ${image_dest}. If the old link is deleted, you may have to update the boot loader. If the link is left in place, it will point to the wrong image.
fr: Un ancien lien symbolique ${image_dir}/initrd est présent. Il est maintenant au même emplacement que le lien symbolique de l'image du noyau, c'est-à-dire dans ${image_dest}. Si cet ancien lien est supprimé, vous devrez mettre à jour le programme de démarrage (« boot loader »). S'il est conservé, il pointera vers la mauvaise image.

source: Should the old /System.map link be deleted now?
fr: Faut-il supprimer l'ancien lien /System.map maintenant ?

source: You have /System.map symbolic link. These were installed by ancient kernel image packages. However, all the programs that look at the information in the map files (including top, ps, and klogd) also will look at /boot/System.map-=V Having the symbolic link in / is technically detrimental (apart from cluttering up /); many programs, though looking in /boot, still allow /System.map to override. If you install multiple kernels on this machine, then the /System.map symbolic link only applies to one such kernel, for all other choices the symbols loaded will be wrong. Not having /System.map at all prevents this.
fr: Un lien symbolique /System.map est présent. Il a été installé par un ancien paquet d'image du noyau. Toutefois, tous les programmes qui obtiennent des informations des fichiers de correspondances (dont top, ps et klogd) en obtiennent aussi de /boot/System.map-=V. La présence de ce lien symbolique dans le répertoire racine est déconseillée (pas seulement à cause de la place occupée). Beaucoup de programmes, même s'ils utilisent /boot, utilisent /System.map en premier lieu. Si vous installez plusieurs noyaux sur cette machine, le lien symbolique /System.map ne correspondra qu'à un seul d'entre eux. Pour tous les autres, les symboles chargés seront incorrects. Pour cette raison, il est conseillé de supprimer /System.map.

source: Run the default bootloader?
fr: Faut-il lancer le programme de démarrage (« boot loader ») par défaut ?

source: The default boot loader for this architecture is $loader, which is present. However, you have not explicitly requested the boot loader $loader should be run in the configuration file /etc/kernel-img.conf, and you seem to have grub installed, and have set a postinst hook (which is used to hook in grub after a kernel image installation). At this point, it is perfectly likely that this system is using grub as a bootloader, and not the builtin default of $loader. If that is the case, running $loader instead of grub might make the machine unbootable. I need to know whether to run the default bootloader $loader, or just let the postinst hook script update grub later. The default is to run $loader.
fr: Le programme de démarrage par défaut pour cette architecture, $loader, est présent. Cependant, vous n'avez pas explicitement demandé dans le fichier de configuration /etc/kernel-img.conf qu'il soit exécuté, alors que GRUB semble être installé, et a défini une action de post-installation (utilisée pour mettre GRUB à jour après l'installation d'une image de noyau). Il est donc tout-à-fait probable que ce système utilise GRUB comme programme de démarrage, et non $loader. Dans ce cas, exécuter $loader au lieu de GRUB pourrait rendre rendre impossible le démarrage de la machine. Vous devez préciser s'il faut utiliser le programme de démarrage $loader (par défaut), ou simplement laisser le script de post-installation mettre à jour GRUB plus tard.

source: Error running the boot loader in test mode.
fr: Erreur à l'exécution du programme de démarrage (« boot loader ») en mode test.

source: An error occurred while running the boot loader ${loader} in test mode. A log is available in ${temp_file_name}. Please edit /etc/${loader}.conf manually and re-run ${loader}, or make other arrangements to boot your machine.
fr: Une erreur s'est produite lors de l'exécution du programme de démarrage (« boot loader ») ${loader} en mode test. Un journal est disponible dans le fichier ${temp_file_name}. Veuillez modifier /etc/${loader}.conf vous-même et relancer ${loader}, ou effectuer d'autres modifications pour pouvoir démarrer la machine.

source: An error occurred while running the boot loader ${loader}. A log is available in ${temp_file_name}. Please edit /etc/${loader}.conf manually and re-run ${loader}, or make other arrangements to boot your machine.
fr: Une erreur s'est produite lors de l'exécution du programme de démarrage (« boot loader ») ${loader}. Un journal est disponible dans le fichier ${temp_file_name}. Veuillez modifier /etc/${loader}.conf vous-même et relancer ${loader}, ou effectuer d'autres modifications pour pouvoir démarrer la machine.

source: Do you want to abort removal now?
fr: Voulez-vous abandonner la suppression maintenant ?

source: You are running a kernel (version ${running}) and attempting to remove the same version. This is a potentially disastrous action. Not only will /boot/vmlinuz-${running} be removed, making it impossible to boot it, (you will have to take action to change your boot loader to boot a new kernel), it will also remove all modules under the directory /lib/modules/${running}. Just having a copy of the kernel image is not enough, you will have to replace the modules too.
fr: La version actuelle du noyau est la même que celle que vous essayez de supprimer. Cette action est extrêmement risquée. Non seulement /boot/vmlinuz-${running} va être supprimé, le rendant impossible à démarrer (vous devrez faire le nécessaire pour modifier votre programme de démarrage pour lancer un autre noyau), mais les modules présents dans /lib/modules/${running} seront aussi supprimés. Avoir une copie de l'image du noyau ne sera pas suffisant, il faudra aussi remplacer les modules.

source: I repeat, this is very dangerous. If at all in doubt, answer Yes. If you know exactly what you are doing, and are prepared to hose your system, then answer No.
fr: Cette action est très dangereuse. Dans le doute, interrompez l'installation. Vous ne devriez poursuivre que si vous savez exactement ce que vous faites.

source: You have a valid /etc/${loader}.conf file that mentions ${kimage}-=V. Removing =ST-image-=V would invalidate that file. (you will have to edit /etc/${loader}.conf or re-target symbolic links mentioned there (typically, /vmlinuz and /vmlinuz.old) to not refer to ${kimage}-=V and will have to re-run ${loader}).
fr: Le fichier /etc/${loader}.conf fait référence à ${kimage}-=V. La suppression de =ST-image-=V rendrait ce fichier incorrect. Vous devrez modifier /etc/${loader}.conf ou rediriger les liens symboliques qui y sont mentionnés (habituellement /vmlinuz et /vmlinuz.old) pour qu'il ne fasse pas référence à ${kimage}-=V, puis redémarrer ${loader}).

source: I repeat: you shall have to make changes to your boot loader setup and will have to re-run ${loader}.
fr: Vous devrez vraiment modifier la configuration de votre programme de démarrage et relancer ${loader}.
